function uniqueArr(arr) {
    var hash = [];
    for (var i = 0; i < arr.length; i++) {
        if (hash.indexOf(arr[i]) == -1) {
            hash.push(arr[i]);
        }
    }
    return hash;
}

var city = [{
        'ids': [1, 2, 3, 4, 5],
        'bcg': './nw/image/scene04.jpg',
        'text': [
            '青瓦白墙的南方小镇',
            '冉冉升起的孔明灯',
            '替用心祈愿的人们',
            '装满了未来一年的希望',
        ],
        'fixed_text':[
        	'2018年11月6日，第一次去上海的西五街少女【杨大白白白】',
        	'在外滩和恋爱七年的男友合了个影，在2019年的第一天，他们结婚了。',
        ]
    },
    {
        'ids': [6, 7, 8],
        'bcg': './nw/image/scene05.jpg',
        'text': [
            '堆着雪人穿貂放鞭炮',
            '老房子的炊烟还在飘',
            '姥姥家的热炕头',
            '温度刚刚好',
        ],
        'fixed_text':[
        	'西五街少年【飞驰啦】',
        	'2018年带着喜欢的南方女孩儿回哈尔滨看冰雕睡火炕，并给她买了一根东北大板在室外骗着她吃下，那位舌头差点被扯掉的女孩，和他分手了。',
        ]
    },
    {
        'ids': [9, 10, 11, 12],
        'bcg': './nw/image/scene06.jpg',
        'text': [
            '比吃上香辣的家乡菜',
            '更让人觉得温暖的是',
            '和家人老小围坐在火炉旁',
            '好好聊聊',
        ],
        'fixed_text':[
        	'西五街少女【温柔酱周闪闪】',
        	'2018年和心上人在橘子洲头看了一场声势浩大的烟花。她说让她印象最深的，就是飞机在落地那一刻，空气里扑面而来的温润味道。',
        ]
    },
    {
        'ids': [13, 14, 15, 16],
        'bcg': './nw/image/scene07.jpg',
        'text': [
            '岭南人回乡第一件事',
            '便是和至亲好友约上一顿下午茶',
            '家门巷子口那家茶点店',
            '早就成了无法复制的家乡味道',
        ],
        'fixed_text':[
        	'2018年，身材惹火的西五街少女【杨大萌啊】',
        	'穿着性感比基尼在三亚拜托路人男孩为她拍了个照。今天她想对这位跟到厕所索要微信的拍照男孩说：“李彦明你别再每天给我打骚扰电话了，我有男朋友了。',
        ]
    },
    {
        'ids': [17, 18, 19, 20, 21],
        'bcg': './nw/image/scene08.jpg',
        'text': [

            '大西北的年味',
            '是天空触手可及的夜里星辰',
            '是升起袅袅炊烟的老房子',
            '是姥姥厨房里的烟火气',
        ],
        'fixed_text':[
        	'西五街旅游博主【张开心】说',
        	'2018年她终于去了一趟新疆，除了吃到这辈子吃过最新鲜甘甜的水果，她几乎每天都像个土狗子一样，在心里感叹“美人真多”。',
        ]
    },
    {
        'ids': [22, 23, 24, 25, 26],
        'bcg': './nw/image/scene09.jpg',
        'text': [

            '面食是中原人士最热衷的美食',
            '饺子和母亲亲手烙的饼',
            '是年夜饭桌上的必备菜',
        ],
        'fixed_text':[
        	'西五街少女【ok妹】',
        	'当了半年的新晋北漂，她说如果哪天要离开了，她最舍不得的，是这些嗓门洪亮说话永远底气十足的热心肠北方人，还有家楼下每天要排队的炒干豆汁煎饼摊儿。',
        ]
    }, {
        'ids': [27, 28, 29, 30, 31],
        'bcg': './nw/image/scene10.jpg',
        'text': [
            '绿水高山辣火锅',
            '巴蜀的麻将俨然成了人们心中的国粹',
            '不和乡里乡亲搓一局牌',
            '都不算过了一个完整的年',
        ],
        'fixed_text':[
        	'西五街少女【大木杨子】',
        	'和心上人旅行的那十二天，最开心的事，是认识了不会骑自行车的重庆女孩儿，是搓了人生中第一场麻将，是用200块吃了好多顿在北京要花500块的火锅。',
        ]
    },
    {
        'ids': [32, 33, 34],
        'bcg': './nw/image/scene11.jpg',
        'text': [
            '在车水马龙的街道',
            '和三五好友等待着新年的到来',
            'LED屏幕上倒数跳动的数字',
            '就像装满了未来整年的希望',
        ],
        'fixed_text':[
        	'令长年穿梭在两岸三地的白领少女【吴段子姑娘】',
        	'记忆最深刻的——是槟郎大赛里长得最好看的那个姑娘、是澳洲牛奶公司门口永远都排着的长队、是时代广场从来川流不息的人群，和八佰伴总在被代购疯抢的打折。',
        ]
    },
]

var dataJson = [{
        level: "1",
        name: "上海",
        value: '1',
    },
    {
        level: "2",
        name: "江苏",
        value: '2',
    },
    {
        level: "3",
        name: "浙江",
        value: '3',
    },
    {
        level: "4",
        name: "山东",
        value: '4',
    },
    {
        level: "5",
        name: "安徽",
        value: '5',
    },
    {
        level: "6",
        name: "辽宁",
        value: '6',
    },
    {
        level: "7",
        name: "吉林",
        value: '7',
    },
    {
        level: "8",
        name: "黑龙江",
        value: '8',
    },
    {
        level: "9",
        name: "湖北",
        value: '9',
    },
    {
        level: "10",
        name: "湖南",
        value: '10',
    },
    {
        level: "11",
        name: "河南",
        value: '11',
    },
    {
        level: "12",
        name: "江西",
        value: '12',
    },
    {
        level: "13",
        name: "广东",
        value: '13',
    }, {
        level: "14",
        name: "广西",
        value: '14',
    }, {
        level: "15",
        name: "海南",
        value: '15',
    }, {
        level: "16",
        name: "福建",
        value: '16',
    },
    {
        level: "17",
        name: "陕西",
        value: '17',
    }, {
        level: "18",
        name: "甘肃",
        value: '18',
    }, {
        level: "19",
        name: "新疆",
        value: '19',
    }, {
        level: "20",
        name: "青海",
        value: '20',
    }, {
        level: "21",
        name: "宁夏",
        value: '21',
    },
    {
        level: "22",
        name: "北京",
        value: '22',
    }, {
        level: "23",
        name: "天津",
        value: '23',
    }, {
        level: "24",
        name: "河北",
        value: '24',
    }, {
        level: "25",
        name: "山西",
        value: '25',
    }, {
        level: "26",
        name: "内蒙古",
        value: '26',
    },
    {
        level: "27",
        name: "四川",
        value: '27',
    }, {
        level: "28",
        name: "云南",
        value: '28',
    }, {
        level: "29",
        name: "贵州",
        value: '29',
    }, {
        level: "30",
        name: "西藏",
        value: '30',
    }, {
        level: "31",
        name: "重庆",
        value: '31',
    },
    {
        level: "32",
        name: "香港",
        value: '32',
    }, {
        level: "33",
        name: "澳门",
        value: '33',
    }, {
        level: "34",
        name: "台湾",
        value: '34',
    },
]